src/BusinessProcesses/Закупка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<BusinessProcess>
		<Properties>
			<Name>Закупка</Name>
			<BasedOn>
				<xr:Item>Document.ЗаказКлиента</xr:Item>
			</BasedOn>
			<Task>Task.ЗадачиПользователя</Task>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Результат</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатСогласования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</BusinessProcess>
</MetaDataObject>

src/BusinessProcesses/Закупка/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
		Предмет = ДанныеЗаполнения.Ссылка;
	КонецЕсли;   
	Автор = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ЗаказатьПоставщикуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ) 
	ФормируемыеЗадачи[0].Пользователь = Автор;

КонецПроцедуры

Процедура СогласоватьЗакупкуПриСозданииЗадач(ТочкаМаршрутаБизнесПроцесса, ФормируемыеЗадачи, Отказ)
	ФормируемыеЗадачи[0].Подразделения = Справочники.Подразделения.Бухгалтерия;
КонецПроцедуры

Процедура ТребуетсяСогласованиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	УстановитьПривилегированныйРежим(Истина);
	Результат = Предмет.Сумма > Константы.СуммаПриобретенияТребующаяСогласования.Получить(); 
	УстановитьПривилегированныйРежим(Ложь);
КонецПроцедуры

Процедура СогласоватьЗакупкуПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	Результат = Задача.Результат;      
	ЭтотОбъект.Записать();
КонецПроцедуры
